НП/src/Catalogs/АбонементыКонтрагента/АбонементыКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АбонементыКонтрагента</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ВидАбонемента</name>
    <type>
      <types>CatalogRef.ВидыАбонементов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

НП/src/Documents/ПродажаАбонемента/ПродажаАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаАбонемента</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.АбонементыКонтрагентов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАбонемента</name>
      <type>
        <types>CatalogRef.ВидыАбонементов</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Абонемент</name>
      <type>
        <types>CatalogRef.АбонементыКонтрагента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

НП/src/Catalogs/АбонементыКонтрагента/Forms/ФормаВыбораСОстатками/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МоментДокумента") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("МоментДокумента",Параметры.МоментДокумента);
	КонецЕсли;
	Если Параметры.Свойство("Контрагент") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент",Параметры.Контрагент);
		Контрагент = Параметры.Контрагент;
	КонецЕсли;
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("СсылкаНаОбъект",Параметры.СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Абонемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАбонемент(Команда)
	
	СтруктураНовогоДокумента = Новый Структура("Контрагент",Контрагент); 
	
	Адрес = ПоместитьВоВременноеХранилище(СтруктураНовогоДокумента);//ПолучитьАдресНовогоДокумента(ЭтаФорма.УникальныйИдентификатор);
	ПараметрыНовгоДокумента = Новый Структура("АдресХранилища", Адрес);
	ОткрытьФорму("Документ.ПродажаАбонемента.ФормаОбъекта", ПараметрыНовгоДокумента, ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Новый ОписаниеОповещения("СозданиеАбонементаПослеСозданияНаСервере",ЭтотОбъект, Новый Структура),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура СозданиеАбонементаПослеСозданияНаСервере(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Абонемент);
КонецПроцедуры

#КонецОбласти
